// Ýòîò èñõîäíûé êîä ïðèìåðîâ MFC äåìîíñòðèðóåò ôóíêöèîíèðîâàíèå ïîëüçîâàòåëüñêîãî èíòåðôåéñà Fluent íà îñíîâå MFC â Microsoft Office
// ("Fluent UI") è ïðåäîñòàâëÿåòñÿ èñêëþ÷èòåëüíî êàê ñïðàâî÷íûé ìàòåðèàë â êà÷åñòâå äîïîëíåíèÿ ê
// ñïðàâî÷íèêó ïî ïàêåòó Microsoft Foundation Classes è ñâÿçàííîé ýëåêòðîííîé äîêóìåíòàöèè,
// âêëþ÷åííîé â ïðîãðàììíîå îáåñïå÷åíèå áèáëèîòåêè MFC C++.
// Óñëîâèÿ ëèöåíçèîííîãî ñîãëàøåíèÿ íà êîïèðîâàíèå, èñïîëüçîâàíèå èëè ðàñïðîñòðàíåíèå Fluent UI äîñòóïíû îòäåëüíî.
// Äëÿ ïîëó÷åíèÿ äîïîëíèòåëüíûõ ñâåäåíèé î íàøåé ïðîãðàììå ëèöåíçèðîâàíèÿ Fluent UI ïîñåòèòå âåá-ñàéò
// https://go.microsoft.com/fwlink/?LinkId=238214.
//
// (C) Êîðïîðàöèÿ Ìàéêðîñîôò (Microsoft Corp.)
// Âñå ïðàâà çàùèùåíû.

#pragma once

// Âêëþ÷åíèå SDKDDKVer.h îáåñïå÷èâàåò îïðåäåëåíèå ñàìîé ïîñëåäíåé äîñòóïíîé ïëàòôîðìû Windows.

// Åñëè òðåáóåòñÿ âûïîëíèòü ñáîðêó ïðèëîæåíèÿ äëÿ ïðåäûäóùåé âåðñèè Windows, âêëþ÷èòå WinSDKVer.h è
// çàäàéòå äëÿ ìàêðîñà _WIN32_WINNT çíà÷åíèå ïîääåðæèâàåìîé ïëàòôîðìû ïåðåä âêëþ÷åíèåì SDKDDKVer.h.

#include <SDKDDKVer.h>
